## common brew formulae
# used to install formulae to install by brew_setup.sh

# Install the packages for this file (from Brewfile directory)
# brew bundle

### Prog Apps ####################

brew 'python@3.10'
brew 'pipenv'
brew 'pyenv'
# brew 'python@3.8'
# brew 'python@3.9'
# brew 'node@16'

brew 'gh'
brew 'git'
brew 'glab'

brew 'aws-sam-cli'
brew 'awscli'
# cask 'google-cloud-sdk'

cask 'visual-studio-code'
cask 'docker'
brew 'terraform'


# cask 'sqlectron'
# cask 'snowflake-snowsql'
# brew 'sqlite'

brew 'jq'

### UI Apps ############################
cask 'alfred'
cask 'rectangle'

### System Apps ########################
cask 'iterm2'
cask 'rar'
cask 'lulu'
brew 'topgrade'
brew 'wget'
brew 'tree'
brew 'qpdf'

### Daily Apps #########################
cask 'appcleaner'
cask 'gimp'
cask 'vlc'
cask 'google-chrome'
cask 'notion'
cask 'deezer'
cask 'transmission'
# cask 'balenaetcher'
